---
kind: property
id: P:Autodesk.Revit.DB.CategorySet.IsEmpty
source: html/2f0f4daf-bbd3-457b-036d-f61830adad21.htm
---
# Autodesk.Revit.DB.CategorySet.IsEmpty Property

Test to see if the set is empty.

## Syntax (C#)
```csharp
public virtual bool IsEmpty { get; }
```

## Remarks
If the set is empty then True will be returned, otherwise False.